Merge pull request #72 from AIappsGBBFactory/v2-pablosal-merge-deployment-changes
V2 pablosal merge deployment optimizations branch
